backend/controllers/AuctionController.php

INSERT INTO `auction` (`auc_img`, `auc_title`, `auc_text`, `start_date`, `end_date`, `active`, `bid_min`) VALUES ('', 'Тортик х', 'Тортик наполненный полным сшщастьеМмм...', '2019-09-14 21:35', '2019-09-14 21:35', 1, 25)
---
    public function actionCreate()
    {
        $model = new Auction();
        $products = Product::find()->where(['active' => 1])->asArray()->all();
        $product_options = ProductOption::find()->asArray()->all();


        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `product` WHERE `active`=1
SELECT * FROM `product_option`
---
    public function actionUpdate($id)
    {
        $model = $this->findModel($id);
        $products = Product::find()->where(['active' => 1])->asArray()->all();
        $product_options = ProductOption::find()->asArray()->all();

SELECT * FROM `auction` WHERE `id`='11'
---
    protected function findModel($id)
    {
        if (($model = Auction::findOne($id)) !== null) {