backend/controllers/OrderController.php

    protected function findModel($id)
    {
        if (($model = Order::findOne($id)) !== null) {
---
SELECT * FROM `order` WHERE `id`='22'