backend/controllers/PageController.php

    public function actionUpdate($id)
    {
        $model = $this->findModel($id);
        $categories = PageCategory::find()->asArray()->all();
---
SELECT * FROM `page_category`

    protected function findModel($id)
    {
        if (($model = Page::findOne($id)) !== null) {
---
SELECT * FROM `page` WHERE `id`='19'