backend/controllers/ProductController.php

SELECT * FROM `product_category`
SELECT * FROM `price_type`
SELECT * FROM `product_option`
SELECT * FROM `product_option_rel` WHERE `product_id`=2769
---
    public function actionUpdate($id)
    {
        $model = $this->findModel($id);
        $uploadImage = new UploadImage();
        $categories = ProductCategory::find()->asArray()->all();
        $priceType = PriceType::find()->asArray()->all();
        $options = ProductOption::find()->asArray()->all();
        $product_option = new ProductOptionRel();

        $filledOptions = ProductOptionRel::find()->where(['product_id' => $model->id])->all();

SELECT * FROM `product` WHERE `id`='2769'
---
    protected function findModel($id)
    {
        if (($model = Product::findOne($id)) !== null) {