frontend/controllers/AuctionController.php

    public function actionIndex() {

        $auction = Auction::find()->where(['active' => 1])->one();
---
SELECT * FROM `auction` WHERE `active`=1