frontend/controllers/CartController.php

    public function actionCartAdd() {

        if ( Yii::$app->request->isPost) {

            $userCart = Yii::$app->session->get('cart') ? Yii::$app->session->get('cart') : [];

            $productTmp = Yii::$app->request->post();
            $product = Product::find()->where(['id' => $productTmp['product_id']])->one();
---
SELECT * FROM `product` WHERE `id`='2140'