frontend/controllers/CategoryController.php

SELECT * FROM `product_category`
---
    public function actionIndex($order = 'price') {


        $categories = ProductCategory::find()->all();

SELECT * FROM `product_category` WHERE `id`='1'
SELECT COUNT(*) FROM `product` WHERE (`cat_id`='1') AND (`active`=1)
SELECT * FROM `product` WHERE (`cat_id`='1') AND (`active`=1) LIMIT 12 OFFSET 80
SELECT * FROM `product_category`
---
    public function actionShow($id) {

        $category = ProductCategory::find()->andWhere(['id'=> $id])->all();



        $query = Product::find()
            ->andWhere(['cat_id' => $id])
            ->andWhere(['active' => 1]);

        $pages = new Pagination(['totalCount' => $query->count()]);
        $products = $query->offset($pages->offset)
            ->limit(12)
            ->all();

        $categories = ProductCategory::find()->all();