frontend/controllers/CustomController.php

SELECT * FROM `product_category` WHERE `cat_slug`='custom'
SELECT * FROM `product_category`
---
    public function actionIndex()
    {
        $custom_form = new Custom();
        $category = ProductCategory::find()->where(['cat_slug' => 'custom'])->one();
        $categories = ProductCategory::find()->all();