frontend/controllers/OrderController.php

    public function actionCreate()
    {

        $userCart = Yii::$app->session->get('cart') ? Yii::$app->session->get('cart') : [];
        $productsInCart = Cart::getProducts($userCart);

//        var_dump($productsInCart); exit;

        $note = Yii::$app->request->post()['orderNote'];
        $user_id = Yii::$app->user->id;
        $payment_method = Yii::$app->session->get('paymentMethod');
        $amount = $userCart['sum'];

        $order = new Order();

        $order->user_id = $user_id;
        $order->amount = $amount;
        $order->payment_method = $payment_method;
        $order->note = $note;

        if ($order->save()) {
            foreach ($productsInCart as $product) {
                $orderProduct = new OrderProduct();
                $orderProduct->order_id =$order->id;
                $orderProduct->product_id = $product['product']['id'];
                $orderProduct->quantity = $product['quantity'];
                $orderProduct->price = $product['price'];
                $orderProduct->product_option = $product['option']['id'];
                $orderProduct->sum = $product['sum'];

                if(!$orderProduct->save()) {
---
INSERT INTO `order` (`user_id`, `amount`, `payment_method`, `note`) VALUES (30, 5260, 2, '')
INSERT INTO `order_product` (`order_id`, `product_id`, `quantity`, `price`, `product_option`, `sum`) VALUES (36, 2141, 2, 1210, 19, 2420)