frontend/controllers/PageController.php

    public function actionIndex($id)
    {
        $page =
            (Page::find()
                ->where(['id' => $id])
                ->one())
                            ??
            (Page::find()
                ->where(['page_slug' => $id])
                ->one());

        if (!$page) {
            return $this->goHome();
        }

        $category = PageCategory::find()
            ->where(['id' => $page->parent_id])
            ->one();

        $pagesInCategory = Page::find()
            ->where(['parent_id' => $page->parent_id])
            ->all();
---
SELECT * FROM `page` WHERE `id`='fabric'
SELECT * FROM `page` WHERE `page_slug`='fabric'
SELECT * FROM `page_category` WHERE `id`=3
SELECT * FROM `page` WHERE `parent_id`=3