frontend/controllers/PersonalController.php

SELECT * FROM `order` WHERE `id`='34'
---
    public function actionOrder($id)
    {
        $order = Order::findOne($id);

SELECT * FROM `order` WHERE `user_id`=30
---
    public function actionOrders()
    {
        $orders = Order::find()->where(['user_id' => Yii::$app->user->id])->all();