frontend/controllers/ProductController.php

SELECT * FROM `product` WHERE `id`='2140' LIMIT 1
SELECT * FROM `product_category` WHERE `id`=1 LIMIT 1
SELECT * FROM `product_category`
SELECT * FROM `product` WHERE `cat_id`=1
---
    public function actionIndex($id) {

        $product = Product::find()->where(['id' => $id])->limit(1)->one();

        $category = ProductCategory::find()->where(['id' => $product->cat_id])->limit(1)->one();

        $categories = ProductCategory::find()->all();

        $products = Product::find()
            ->where(['cat_id' => $product->cat_id])
            ->all();