frontend/controllers/SiteController.php

    public function actionIndex()
    {
        $categories = ProductCategory::find()->all();
        $menu_items = \common\models\MenuItem::find()->where(['menu_id' => 1])->all();
        $site_inform = Page::findOne(4);
        $auction = Auction::find()->where(['active' => Auction::$STATUS_ACTIVE ])->one();
---
SELECT * FROM `product_category`
SELECT * FROM `menu_item` WHERE `menu_id`=1
SELECT * FROM `page` WHERE `id`=4
SELECT * FROM `auction` WHERE `active`=1

    public function actionSignup()
    {
        $model = new SignupForm();
        if ($model->load(Yii::$app->request->post()) && $model->signup()) {
//            Yii::$app->session->setFlash('success', 'Thank you for registration. Please check your inbox for verification email.');
            $loginForm = new LoginForm();
            $loginForm->email = $model->email;
            $loginForm->password = $model->password;
            $loginForm->login();
            return $this->goHome();
        }

        $policy = Page::find()->where(['page_slug' => 'policy'])->one();
---
SELECT * FROM `page` WHERE `page_slug`='policy'