common/components/MainMenuWidget.php

SELECT * FROM `menu_item` WHERE `menu_id`=1
---
    public function run(){
        // get cache
        if($this->tpl == 'menu.php'){
            $menu = Yii::$app->cache->get('menu');
            if($menu) return $menu;
        }

        $this->data = \common\models\MenuItem::find()->where(['menu_id' => $this->id])->asArray()->all();