common/components/Settings.php

SELECT * FROM `settings` WHERE `type`='settings'
---
    public function init()
    {
        $this->set = \common\models\Settings::findOne(['type' => 'settings']);