common/models/ProductCategory.php

SELECT * FROM `product` WHERE `cat_id`=1
---
    public function getProductCount()
    {
        return count(Product::find()->where(['cat_id' => $this->id])->asArray()->all());