common/models/User.php

    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM `user` WHERE (`id`=23) AND (`status`=10)

    public static function findByPasswordResetToken($token)
    {
        if (!static::isPasswordResetTokenValid($token)) {
            return null;
        }

        return static::findOne([
            'password_reset_token' => $token,
            'status' => self::STATUS_ACTIVE,
        ]);
---
SELECT * FROM `user` WHERE (`password_reset_token`='MdQ5qMJ8WjapFmMYBqzzMioxeDIXm2UG_1568327471') AND (`status`=10)