frontend/views/category/index.php

                    <h1 class="pt-5"><?= $category['title'] ?></h1>
                </div>

                    <?php foreach ($category->getProducts()->limit(4)->all() as $product):?>
---
SELECT * FROM `product` WHERE `cat_id`=1 LIMIT 4