frontend/views/personal/order.php

                </thead>
                <tbody>

                <?php $sum = 0; $i = 1; foreach ($order->orderProduct as $product): ?>
---
SELECT * FROM `order_product` WHERE `order_id`=34