frontend/views/personal/orders.php

SELECT * FROM `order_status` WHERE `code`=1
---
                                1 => "#ffc107", 2 => '#1e7e34', 3 => 'yellow', 4 => 'gray'
                            ];
                         ?>
                        <td><span style="background-color: <?= $colors[$order->orderStatus->code]?>"> <?= $order->orderStatus->name ?></span></td>