backend/views/order/index.php


    <?= GridView::widget([
        'dataProvider' => $dataProvider,
        'columns' => [
//            ['class' => 'yii\grid\CheckboxColumn'],
            'id',
            [
                'attribute' => 'user_id',
                'value' => function ($data) {
                    return $data->user->email;
                }
            ],
            [
                'attribute' => 'payment_method',
                'format' => 'html',
                'value' => function ($data) {
                    return $data->paymentMethod->title;
                }
            ],
            [
                'attribute' => 'status',
                'format' => 'html',
                'value' => function ($data) {
                    return "<span style='color: {$data->orderStatus->color}'>{$data->orderStatus->name}</span>";
                }
            ],
            'created_at',
            ['class' => 'yii\grid\ActionColumn'],
        ],
---
SELECT * FROM `user` WHERE `id`=30
SELECT * FROM `payment_method` WHERE `id`=1