frontend/models/AuctionForm.php

SELECT * FROM `auction` WHERE `id`='12'
---
    public function validateBid($attribute, $params, $validator)
    {
        $auction = Auction::findOne($this->aucId);