frontend/models/Cart.php

    public static function getProducts($cart, $total = false) {

        $products = [];
        $i = 0;
        foreach ($cart as $item) {
            $product['product'] = Product::find()->where(['id' => $item['product_id']])->asArray()->one();
            $product['option'] = isset($item['product_option']) ? ProductOption::find()->where(['id' => $item['product_option']])->asArray()->one() : null;
---
SELECT * FROM `product` WHERE `id`='2141'
SELECT * FROM `product_option` WHERE `id` IN ('21', '20', '19', '18', '15', '14', '17', '13', '12', '11')