frontend/models/ResetPasswordForm.php

UPDATE `user` SET `password_hash`='$2y$13$RdHA5peW4c4lNEqup5nRW.8yQ5swIMC3XQ3QZIWwSmIzuS45mZmuC', `password_reset_token`=NULL, `updated_at`=1568327933 WHERE `id`=34
---
    public function resetPassword()
    {
        $user = $this->_user;
        $user->setPassword($this->password);
        $user->removePasswordResetToken();

        return $user->save(false);