frontend/views/auction/index.php

SELECT * FROM `page` WHERE `page_slug`='auc-rules'
---
        </div>

        <div class="auc-text mb-5">
         <?= \common\models\Page::findOne(['page_slug' => 'auc-rules'])->content ?>